Revit 2027 API
NumberSystem.JustifyOption Property
 The number justify option of number system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberSystemJustifyOption JustifyOption { get; set; }
Public Property JustifyOption As NumberSystemJustifyOption
	Get
	Set
public:
property NumberSystemJustifyOption JustifyOption {
	NumberSystemJustifyOption get ();
	void set (NumberSystemJustifyOption value);
}
member JustifyOption : NumberSystemJustifyOption with get, set
Property Value
NumberSystemJustifyOption
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace